//Задание № 1
// let arr = [1, 2, 3, 4, 5];
// console.log(arr[arr.length]); //Showstopper. Критические проблемы в приложении или аппаратном обеспечении.


//Задание № 2
// let arr = [1, 2, 3, 4, 5];
// console.log(arr[1] + arr[2] + arr[3] + arr[4] + arr[5]); //Showstopper. Критические проблемы в приложении или аппаратном обеспечении.

//Задание № 3
// let arr = {1, 2, 3, 4, 5};
// console.log(arr.length]);//Showstopper. Критические проблемы в приложении или аппаратном обеспечении.

//Задание № 4
// let arr = [1, 2, 3, 4, 5];
// console.log(arr.lenght);//Showstopper. Критические проблемы в приложении или аппаратном обеспечении.